In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1': np.random.randn(5),
                'data2': np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.712167  0.200721    a  one
1  0.166757 -0.172740    a  two
2 -0.678832 -1.717042    b  one
3 -1.158373  0.524592    b  two
4  0.155337  0.733162    a  one

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.678087
b   -0.918603
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.933752
      two     0.166757
b     one    -0.678832
      two    -1.158373
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a     0.933752  0.166757
b    -0.678832 -1.158373

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.166757
            2006   -0.678832
Ohio        2005    0.276897
            2006    0.155337
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.678087  0.253714
b    -0.918603 -0.596225

In [9]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.933752  0.466942
     two   0.166757 -0.172740
b    one  -0.678832 -1.717042
     two  -1.158373  0.524592

In [10]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [11]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.712167  0.200721    a  one
1  0.166757 -0.172740    a  two
4  0.155337  0.733162    a  one
b
      data1     data2 key1 key2
2 -0.678832 -1.717042    b  one
3 -1.158373  0.524592    b  two

In [12]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0  1.712167  0.200721    a  one
4  0.155337  0.733162    a  one
a two
      data1    data2 key1 key2
1  0.166757 -0.17274    a  two
b one
      data1     data2 key1 key2
2 -0.678832 -1.717042    b  one
b two
      data1     data2 key1 key2
3 -1.158373  0.524592    b  two

In [13]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -0.678832 -1.717042    b  one
3 -1.158373  0.524592    b  two

In [14]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Traivs'])
people.loc[2:3, ['b', 'c']] = np.nan

In [15]:
people

               a         b         c         d         e
Joe     0.055166  0.126970 -1.275353  1.370396  1.016744
Steve  -2.078803  0.075739  0.467410 -0.262878  0.820621
Wes    -0.978452       NaN       NaN  0.021169  0.800059
Jim    -1.475504  1.949413  0.247770  0.071262  0.299276
Traivs -1.491116  0.449500 -1.661878 -0.257632 -0.650996

In [16]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     0.095043  1.198880
Steve   0.204532 -1.182442
Wes     0.021169 -0.178393
Jim     0.319032  0.773185
Traivs -1.919510 -1.692612

In [17]:
map_series = Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Traivs     2    3

In [18]:
people.groupby(len).sum()

          a         b         c         d         e
3 -2.398789  2.076382 -1.027582  1.462827  2.116079
5 -2.078803  0.075739  0.467410 -0.262878  0.820621
6 -1.491116  0.449500 -1.661878 -0.257632 -0.650996

In [19]:
df

      data1     data2 key1 key2
0  1.712167  0.200721    a  one
1  0.166757 -0.172740    a  two
2 -0.678832 -1.717042    b  one
3 -1.158373  0.524592    b  two
4  0.155337  0.733162    a  one

In [20]:
grouped = df.groupby('key1')
grouped

In [21]:
grouped['data1'].quantile(0.9)

key1
a    1.403085
b   -0.726786
Name: data1, dtype: float64

In [22]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.556830  0.905902
b     0.479541  2.241634

In [23]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.678087  0.895558  0.155337  0.161047  0.166757  0.939462
b      2.0 -0.918603  0.339087 -1.158373 -1.038488 -0.918603 -0.798718

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.712167   3.0  0.253714  0.455270 -0.172740  0.013991  0.200721
b    -0.678832   2.0 -0.596225  1.585075 -1.717042 -1.156633 -0.596225


           75%       max
key1
a     0.466942  0.733162
b    -0.035816  0.524592

In [24]:
tips = pd.read_csv('tips.csv')

In [25]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [26]:
grouped = tips.groupby(['sex', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [27]:
grouped_pct.agg(['mean','std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [28]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [29]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [30]:
grouped.agg({'tip': 'max', 'size': 'sum'})

               size   tip
sex    smoker
Female No       140   5.2
       Yes       74   6.5
Male   No       263   9.0
       Yes      150  10.0

In [31]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'], 'size': 'sum'})

              size   tip_pct
               sum       min       max      mean       std
sex    smoker
Female No      140  0.056797  0.252672  0.156921  0.036421
       Yes      74  0.056433  0.416667  0.182150  0.071595
Male   No      263  0.071804  0.291990  0.160669  0.041849
       Yes     150  0.035638  0.710345  0.152771  0.090588

In [32]:
df

      data1     data2 key1 key2
0  1.712167  0.200721    a  one
1  0.166757 -0.172740    a  two
2 -0.678832 -1.717042    b  one
3 -1.158373  0.524592    b  two
4  0.155337  0.733162    a  one

In [33]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a       0.678087    0.253714
b      -0.918603   -0.596225

In [34]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  1.712167  0.200721    a  one    0.678087    0.253714
1  0.166757 -0.172740    a  two    0.678087    0.253714
4  0.155337  0.733162    a  one    0.678087    0.253714
2 -0.678832 -1.717042    b  one   -0.918603   -0.596225
3 -1.158373  0.524592    b  two   -0.918603   -0.596225

In [35]:
people

               a         b         c         d         e
Joe     0.055166  0.126970 -1.275353  1.370396  1.016744
Steve  -2.078803  0.075739  0.467410 -0.262878  0.820621
Wes    -0.978452       NaN       NaN  0.021169  0.800059
Jim    -1.475504  1.949413  0.247770  0.071262  0.299276
Traivs -1.491116  0.449500 -1.661878 -0.257632 -0.650996

In [36]:
key = ['one', 'two', 'one', 'two', 'one']
people.groupby(key).mean()

            a         b         c         d         e
one -0.804801  0.288235 -1.468615  0.377978  0.388602
two -1.777153  1.012576  0.357590 -0.095808  0.559949

In [37]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.804801  0.288235 -1.468615  0.377978  0.388602
Steve  -1.777153  1.012576  0.357590 -0.095808  0.559949
Wes    -0.804801  0.288235 -1.468615  0.377978  0.388602
Jim    -1.777153  1.012576  0.357590 -0.095808  0.559949
Traivs -0.804801  0.288235 -1.468615  0.377978  0.388602

In [38]:
def demean(arr):
    return arr - arr.mean()

people.groupby(key).transform(demean)

               a         b         c         d         e
Joe     0.859967 -0.161265  0.193262  0.992418  0.628142
Steve  -0.301650 -0.936837  0.109820 -0.167070  0.260673
Wes    -0.173651       NaN       NaN -0.356808  0.411456
Jim     0.301650  0.936837 -0.109820  0.167070 -0.260673
Traivs -0.686316  0.161265 -0.193262 -0.635610 -1.039598

In [39]:
demeaned = people.groupby(key).transform(demean)

In [40]:
demeaned.groupby(key).mean()

                a             b             c             d             e
one  3.700743e-17  1.387779e-17  0.000000e+00 -7.401487e-17  0.000000e+00
two -1.110223e-16  0.000000e+00 -2.775558e-17  0.000000e+00  2.775558e-17

In [41]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [42]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [43]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [44]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [45]:
result.unstack('smker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [46]:
f = lambda x: x.describe()
grouped.apply(f)

                     total_bill        tip       size    tip_pct
sex    smoker
Female No     count   54.000000  54.000000  54.000000  54.000000
              mean    18.105185   2.773519   2.592593   0.156921
              std      7.286455   1.128425   1.073146   0.036421
              min      7.250000   1.000000   1.000000   0.056797
              25%     12.650000   2.000000   2.000000   0.139708
              50%     16.690000   2.680000   2.000000   0.149691
              75%     20.862500   3.437500   3.000000   0.181630
              max     35.830000   5.200000   6.000000   0.252672
       Yes    count   33.000000  33.000000  33.000000  33.000000
              mean    17.977879   2.931515   2.242424   0.182150
              std      9.189751   1.219916   0.613917   0.071595
              min      3.070000   1.000000   1.000000   0.056433
              25%     12.760000   2.000000   2.000000   0.152439
              50%     16.270000   2.880000   2.000000   0.173913
              75%     22.120000   3.500000   2.000000   0.198216
              max     44.300000   6.500000   4.000000   0.416667
Male   No     count   97.000000  97.000000  97.000000  97.000000
              mean    19.791237   3.113402   2.711340   0.160669
              std      8.726566   1.489559   0.989094   0.041849
              min      7.510000   1.250000   2.000000   0.071804
              25%     13.810000   2.000000   2.000000   0.131810
              50%     18.240000   2.740000   2.000000   0.157604
              75%     22.820000   3.710000   3.000000   0.186220
              max     48.330000   9.000000   6.000000   0.291990
       Yes    count   60.000000  60.000000  60.000000  60.000000
              mean    22.284500   3.051167   2.500000   0.152771
              std      9.911845   1.500120   0.892530   0.090588
              min      7.250000   1.000000   1.000000   0.035638
              25%     15.272500   2.000000   2.000000   0.101845
              50%     20.390000   3.000000   2.000000   0.141015
              75%     28.572500   3.820000   3.000000   0.191697
              max     50.810000  10.000000   5.000000   0.710345

In [47]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [48]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [49]:
frame = DataFrame({'data1': np.random.randn(1000),
                   'data2': np.random.randn(1000)})
factor = pd.cut(frame.data1, 4)

In [50]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

grouped=frame.data2.groupby(factor)
grouped

In [51]:
grouped.apply(get_stats)

data1
(-4.276, -2.463]  count     10.000000
                  max        1.498930
                  mean       0.166637
                  min       -1.038811
(-2.463, -0.657]  count    231.000000
                  max        3.052394
                  mean       0.033361
                  min       -3.209087
(-0.657, 1.149]   count    629.000000
                  max        3.578654
                  mean      -0.013285
                  min       -3.478169
(1.149, 2.955]    count    130.000000
                  max        2.419686
                  mean      -0.031821
                  min       -2.374397
Name: data2, dtype: float64

In [52]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-4.276, -2.463]   10.0  1.498930  0.166637 -1.038811
(-2.463, -0.657]  231.0  3.052394  0.033361 -3.209087
(-0.657, 1.149]   629.0  3.578654 -0.013285 -3.478169
(1.149, 2.955]    130.0  2.419686 -0.031821 -2.374397

In [53]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.343769 -0.060289 -3.209087
1      100.0  3.052394  0.191652 -2.719883
2      100.0  2.627119  0.035487 -2.314199
3      100.0  2.498478 -0.157187 -2.176498
4      100.0  2.261338 -0.026282 -2.433026
5      100.0  3.578654  0.193155 -3.478169
6      100.0  2.615189 -0.024696 -2.709673
7      100.0  2.059388 -0.100628 -2.773685
8      100.0  1.957433 -0.074550 -2.515521
9      100.0  2.419686 -0.007862 -2.012166

In [54]:
s = Series(np.random.randn(6))
s[::2] = np.nan

In [55]:
s

0         NaN
1    0.064693
2         NaN
3    0.347474
4         NaN
5    0.722262
dtype: float64

In [56]:
s.fillna(s.mean())

0    0.378143
1    0.064693
2    0.378143
3    0.347474
4    0.378143
5    0.722262
dtype: float64

In [57]:
states = ['Ohio', 'New York', 'Vermont', 'Floria',
          'Oregon', 'Nevada', 'Clifornia', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = Series(np.random.randn(8), index=states)
data

Ohio        -0.246095
New York     0.813058
Vermont      1.936882
Floria      -0.626022
Oregon       0.833662
Nevada      -0.673770
Clifornia    0.530302
Idaho       -0.480054
dtype: float64

In [58]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio        -0.246095
New York     0.813058
Vermont           NaN
Floria      -0.626022
Oregon       0.833662
Nevada            NaN
Clifornia    0.530302
Idaho             NaN
dtype: float64

In [59]:
data.groupby(group_key).mean()

East   -0.019686
West    0.681982
dtype: float64

In [60]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio        -0.246095
New York     0.813058
Vermont     -0.019686
Floria      -0.626022
Oregon       0.833662
Nevada       0.681982
Clifornia    0.530302
Idaho        0.681982
dtype: float64

In [61]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'Q', 'K']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)

In [62]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

draw(deck)

10C    10
4S      4
10D    10
2H      2
JH     10
dtype: int64

In [63]:
draw(deck)

JC     10
2H      2
KH     10
AS      1
10S    10
dtype: int64

In [65]:
df = DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                'data': np.random.randn(8),
                'weights': np.random.rand(8)})
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

category
a    0.271191
b   -0.235217
dtype: float64

In [69]:
close_px = pd.read_csv('stock_px.csv', parse_dates=True, index_col=0)
rets=close_px.pct_change().dropna()

In [70]:
spx_corr = lambda x: x.corrwith(x['SPX'])
by_year = rets.groupby(lambda x: x.year)

In [72]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [75]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64